---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.DocumentType
source: html/0d94b412-5685-dd91-7cae-e987e0e2ebbb.htm
---
# Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.DocumentType Property

Type of the document, e.g. Project or Template.

## Syntax (C#)
```csharp
public DocumentType DocumentType { get; }
```